app/controllers/add_user_controller.rb

    def create
      user = User.new(user_name: params[:user_name],
                      password_confirmation: params[:password_confirmation],
                      password: params[:password],
                      email: params[:email],
                      number_of_followers: params[:number_of_followers])

      if user.save
        render json: { message: "User created successfully!" }, status: :created
      else
        render json: { error: "Failed to create user.", errors: user.errors.full_messages }, status: :unprocessable_entity
      end
    user_id = AuthToken.find_user_id_by_token(params[:token])
---
INSERT INTO "users" ("user_name", "created_at", "updated_at", "email", "number_of_followers", "password_digest") VALUES (?, ?, ?, ?, ?, ?)
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" IS NULL LIMIT ?  [["LIMIT", 1]]