app/controllers/add_posts_controller.rb

    def create

      user_id = AuthToken.find_user_id_by_token(params[:token])
      title = params[:title]
      topic = params[:topic]
      post_date = Date.today
      text = params[:text]
      subtitle = params[:subtitle]

      number_likes = 0
      number_comm = 0
      number_of_views = 0
      total_reading_time = 0


      post = Post.new(
        user_id: user_id,
        title: title,
        topic: topic,
        post_date: post_date,
        text: text,
        subtitle: subtitle,
        number_likes: number_likes,
        number_comm: number_comm,
        number_of_views: number_of_views,
        total_reading_time: total_reading_time
      )



      if post.save
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "posts" ("user_id", "title", "topic", "post_date", "text", "number_likes", "number_comm", "number_of_views", "total_reading_time", "created_at", "updated_at", "subtitle") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

        action: "add"
      )

      version.save
---
INSERT INTO "versions" ("post_id", "user_id", "title", "subtitle", "text", "topic", "imageURL", "version", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def destroy
      post = Post.find_by(id: params[:post_id])

      if post.nil?
        render json: { error: "Post not found" }, status: :not_found
      else
        # Make sure only the owner of the post can delete it
        user_id = AuthToken.find_user_id_by_token(params[:token])
        if user_id == post.user_id
          post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 10]]

def update
    post = Post.find_by(id: params[:post_id])

    if post.nil?
      render json: { error: "Post not found" }, status: :not_found
    else
      # Make sure only the owner of the post can update it
      user_id = AuthToken.find_user_id_by_token(params[:token])
      if user_id == post.user_id
        # Get updated details from the params
        title = params[:title]
        topic = params[:topic]
        text = params[:text]
        subtitle = params[:subtitle]

        # Update the post attributes
        post.update(
          title: title,
          topic: topic,
          text: text,
          subtitle: subtitle
        )
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "posts" SET "total_reading_time" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["total_reading_time", 1], ["updated_at", "2023-08-05 04:15:46.503934"], ["id", 4]]

          # version: version,
          action: "update"
        )
        version.save
---
INSERT INTO "versions" ("post_id", "user_id", "title", "subtitle", "text", "topic", "imageURL", "version", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update_reading_time
    post = Post.find(params[:post_id])

    # Get the new reading time from params
    new_reading_time = params[:time].to_i

    # Calculate the new total_reading_time by adding the new reading time to the existing total_reading_time
    total_reading_time = post.total_reading_time.to_i + new_reading_time

    # Update the post with the new total_reading_time
    if post.update(total_reading_time: total_reading_time)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "total_reading_time" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["total_reading_time", 6], ["updated_at", "2023-08-05 12:18:11.896719"], ["id", 4]]