app/controllers/comments_controller.rb

    def create
      # Get details from the params
      user_id = AuthToken.find_user_id_by_token(params[:token])
      post_id = params[:post_id]
      comment_text = params[:comment]

      # Create the new comment
      comment = Comment.new(
        user_id: user_id,
        post_id: post_id,
        comment: comment_text
      )

      if comment.save
        # Increment the number_comm in the associated post
        post = Post.find_by(id: post_id)
        post.increment!(:number_comm) if post
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "user_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 3], ["user_id", 22], ["comment", nil], ["created_at", "2023-08-04 16:00:15.929045"], ["updated_at", "2023-08-04 16:00:15.929045"]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "number_comm" = COALESCE("number_comm", 0) + ? WHERE "posts"."id" = ?  [["number_comm", 1], ["id", 3]]

    def destroy
      # Get details from the params
      user_id = AuthToken.find_user_id_by_token(params[:token])
      comment_id = params[:comment_id]

      # Find and destroy the comment
      comment = Comment.find_by(id: comment_id, user_id: user_id)

      if comment
        # Decrement the number_comm in the associated post
        post = Post.find_by(id: comment.post_id)
        post.decrement!(:number_comm) if post

        comment.destroy
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? AND "comments"."user_id" = ? LIMIT ?  [["id", 3], ["user_id", 22], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "number_comm" = COALESCE("number_comm", 0) - ? WHERE "posts"."id" = ?  [["number_comm", 1], ["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]

    def comments
        post = Post.find_by(id: params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]