app/controllers/drafts_controller.rb

SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "drafts".* FROM "drafts" WHERE "drafts"."user_id" = ?  [["user_id", 22]]
---
    def index
        # Get user_id from the request parameters
        user_id = AuthToken.find_user_id_by_token(params[:token])

        # Find all drafts belonging to the user
        drafts = Draft.where(user_id: user_id)

SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "drafts" ("user_id", "post_img", "title", "topic", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 22], ["post_img", ""], ["title", "\"yo\""], ["topic", "\"toto\""], ["text", "\"heheaa\""], ["created_at", "2023-08-05 04:28:52.602833"], ["updated_at", "2023-08-05 04:28:52.602833"]]
---
    def create
      # Get details from the params
      user_id = AuthToken.find_user_id_by_token(params[:token])
      post_img = "";
      title = params[:title]
      topic = params[:topic]
      text = params[:text]

      # Create the new draft
      draft = Draft.new(
        user_id: user_id,
        post_img: post_img,
        title: title,
        topic: topic,
        text: text
      )

      if draft.save

SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "drafts".* FROM "drafts" WHERE "drafts"."id" = ? AND "drafts"."user_id" = ? LIMIT ?  [["id", 1], ["user_id", 22], ["LIMIT", 1]]
DELETE FROM "drafts" WHERE "drafts"."id" = ?  [["id", 1]]
---
    def destroy
        # Get user_id and draft_id from the request parameters
        user_id = AuthToken.find_user_id_by_token(params[:token])
        draft_id = params[:draft_id]

        # Find the draft to be deleted
        draft = Draft.find_by(id: draft_id, user_id: user_id)

        if draft.nil?
          render json: { error: "Draft not found or not authorized to delete" }, status: :not_found
        else
          draft.destroy