app/controllers/followings_controller.rb

    def follow_user
      user_id = AuthToken.find_user_id_by_token(params[:token])
      user_follower_id = user_id # The logged-in user follows another user
      following_user_id = params[:user_id] # The user to be followed

      # Check if the user to be followed exists
      following_user = User.find_by(id: following_user_id)
      unless following_user
        render json: { error: "User not found" }, status: :unprocessable_entity
        return
      end

      # Check if the user is already being followed
      if Following.exists?(user_follower_id: user_follower_id, user_id: following_user_id)
        render json: { message: "User is already being followed" }, status: :ok
        return
      end

      # Create the following record
      following = Following.new(
        user_follower_id: user_follower_id,
        user_id: following_user_id
      )

      if following.save
        # Increment the number of followers for the followed user
        following_user.increment!(:number_of_followers)
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
SELECT 1 AS one FROM "followings" WHERE "followings"."user_follower_id" = ? AND "followings"."user_id" = ? LIMIT ?  [["user_follower_id", 22], ["user_id", 25], ["LIMIT", 1]]
INSERT INTO "followings" ("user_follower_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_follower_id", 22], ["user_id", 25], ["created_at", "2023-08-05 03:01:34.704555"], ["updated_at", "2023-08-05 03:01:34.704555"]]
UPDATE "users" SET "number_of_followers" = COALESCE("number_of_followers", 0) + ? WHERE "users"."id" = ?  [["number_of_followers", 1], ["id", 25]]

    def unfollow_user
        user_id = AuthToken.find_user_id_by_token(params[:token])
        user_follower_id = user_id # The logged-in user who is currently following
        following_user_id = params[:user_id] # The user to be unfollowed

        # Check if the user to be unfollowed exists
        following_user = User.find_by(id: following_user_id)
        unless following_user
          render json: { error: "User not found" }, status: :unprocessable_entity
          return
        end

        # Check if the user is already not being followed
        following = Following.find_by(user_follower_id: user_follower_id, user_id: following_user_id)
        unless following
          render json: { message: "User is not being followed" }, status: :ok
          return
        end

        if following.destroy
          # Decrement the number of followers for the unfollowed user
          following_user.decrement!(:number_of_followers)
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
SELECT "followings".* FROM "followings" WHERE "followings"."user_follower_id" = ? AND "followings"."user_id" = ? LIMIT ?  [["user_follower_id", 22], ["user_id", 25], ["LIMIT", 1]]
DELETE FROM "followings" WHERE "followings"."id" = ?  [["id", 1]]
UPDATE "users" SET "number_of_followers" = COALESCE("number_of_followers", 0) - ? WHERE "users"."id" = ?  [["number_of_followers", 1], ["id", 25]]

      def list_followings
        user_id = AuthToken.find_user_id_by_token(params[:token])
        user = User.find(user_id)
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]