app/controllers/likes_controller.rb

SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 22], ["post_id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "number_likes" = COALESCE("number_likes", 0) + ? WHERE "posts"."id" = ?  [["number_likes", 1], ["id", 3]]
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 3], ["user_id", 22], ["created_at", "2023-08-04 15:44:25.505488"], ["updated_at", "2023-08-04 15:44:25.505488"]]
---
    def create
      # Get details from the params
      user_id = AuthToken.find_user_id_by_token(params[:token])
      post_id = params[:post_id]

      # Check if the like already exists for this user and post
      like = Like.find_by(user_id: user_id, post_id: post_id)

      if like
        render json: { error: "Like already exists" }, status: :unprocessable_entity
      else
        # Create the new like
        like = Like.new(
          user_id: user_id,
          post_id: post_id
        )

        # Increment the number_likes in the associated post
        post = Post.find_by(id: post_id)
        post.increment!(:number_likes) if post

        if like.save

SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 22], ["post_id", 3], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "number_likes" = COALESCE("number_likes", 0) - ? WHERE "posts"."id" = ?  [["number_likes", 1], ["id", 3]]
---
    def destroy
        # Get details from the params
        user_id = AuthToken.find_user_id_by_token(params[:token])
        post_id = params[:post_id]

        # Find and destroy the like
        like = Like.find_by(user_id: user_id, post_id: post_id)

        if like
          like.destroy

          # Decrement the number_likes in the associated post
          post = Post.find_by(id: post_id)
          post.decrement!(:number_likes) if post

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT 1 AS one FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 3], ["user_id", 22], ["LIMIT", 1]]
---
      def is_liked
        post = Post.find(params[:post_id])
        user_id = AuthToken.find_user_id_by_token(params[:token])

        # Check if the user has liked the post
        is_liked = post.likes.exists?(user_id: user_id)