app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."number_likes" DESC LIMIT ?  [["LIMIT", 10]]
---
    def top_10_by_likes
    # Fetch the top 10 posts by likes in descending order.
    top_10_posts = Post.order(number_likes: :desc).limit(10)