app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("user_id", "post_img", "title", "topic", "post_date", "text", "number_likes", "number_comm", "number_of_views", "total_reading_time", "created_at", "updated_at", "subtitle") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2023-08-03 17:11:19.334852"], ["id", 34]]
---
  def index
    @posts = Post.all.map do |post|
      user = User.find(post.user_id)
      {
        id: post.id,
        user_id: post.user_id,
        user_name: user.user_name,
        number_of_followers: user.number_of_followers,            # Add user_name from User table to each post
        title: post.title,
        topic: post.topic,
        post_date: post.post_date,
        text: post.text,
        subtitle: post.subtitle,
        number_likes: post.number_likes,
        number_comm: post.number_comm,
        number_of_views: post.number_of_views,
        total_reading_time: post.total_reading_time,
        created_at: post.created_at,
        updated_at: post.updated_at

SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 22]]
---
  def getuserpost
    user_id = AuthToken.find_user_id_by_token(params[:token])
    requested_user = params[:user_id]
    user = User.find(requested_user)
    posts = user.posts.map do |post|

SELECT "posts".* FROM "posts" ORDER BY "posts"."number_likes" DESC LIMIT ?  [["LIMIT", 10]]
---
    def top_10_by_likes
    # Fetch the top 10 posts by likes in descending order.
    top_10_posts = Post.order(number_likes: :desc).limit(10)

    formatted_posts = top_10_posts.map do |post|

SELECT "posts".* FROM "posts" WHERE "posts"."topic" = ? ORDER BY "posts"."number_likes" DESC LIMIT ?  [["topic", "Self Improvement"], ["LIMIT", 10]]
---
    def top_recomended_by_like
      topic = params[:topic]
      top_posts = Post.where(topic: topic).order(number_likes: :desc).limit(10)

      formatted_posts = top_posts.map do |post|

SELECT "posts"."topic" FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 22]]
SELECT "posts".* FROM "posts" WHERE "posts"."topic" IN (?, ?)  [["topic", "\"toto\""], ["topic", "Self Improvement"]]
---
    def posts_by_similar_author
      user_id = params[:user_id]
      user_topics = Post.where(user_id: user_id).pluck(:topic)
      posts_with_same_topics = Post.where(topic: user_topics).includes(:user)

      formatted_posts = posts_with_same_topics.map do |post|

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
      post = Post.find(params[:post_id])