app/controllers/save_for_later_controller.rb

    def add_to_save_for_later
      user_id = AuthToken.find_user_id_by_token(params[:token])
      post = Post.find_by(id: params[:post_id])

      if post && user_id
        SaveForLater.create(user_id: user_id, post_id: post.id)
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "save_for_laters" ("user_id", "post_id", "time_stamp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 22], ["post_id", 3], ["time_stamp", nil], ["created_at", "2023-08-04 16:33:41.047614"], ["updated_at", "2023-08-04 16:33:41.047614"]]

    def remove_from_save_for_later
      user_id = AuthToken.find_user_id_by_token(params[:token])
      post = Post.find_by(id: params[:post_id])

      if post && user_id
        save_for_later = SaveForLater.find_by(user_id: user_id, post_id: post.id)
        save_for_later.destroy if save_for_later
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "save_for_laters".* FROM "save_for_laters" WHERE "save_for_laters"."user_id" = ? AND "save_for_laters"."post_id" = ? LIMIT ?  [["user_id", 22], ["post_id", 3], ["LIMIT", 1]]
DELETE FROM "save_for_laters" WHERE "save_for_laters"."id" = ?  [["id", 1]]

    def save_for_later
      user_id = AuthToken.find_user_id_by_token(params[:token])
    user = User.find_by(id: user_id)
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]

    def is_saved_for_later
      user_id = AuthToken.find_user_id_by_token(params[:token])
    user = User.find_by(id: user_id)
      post_id = params[:post_id]

      # Check if the post is saved for later by the specified user
      is_saved = user.save_for_later.exists?(post_id: post_id)
---
SELECT "save_for_laters".* FROM "save_for_laters" WHERE "save_for_laters"."user_id" = ?  [["user_id", 22]]