app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "mail.com"], ["LIMIT", 1]]
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."user_id" = ? AND "auth_tokens"."token" = ? LIMIT ?  [["user_id", 22], ["token", "[FILTERED]"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: params[:email])

    if user&.authenticate(params[:password])
      token = encode_token(user.id)
      user_id = user.id

      # Create or update the auth_token
      auth_token = user.auth_tokens.find_or_initialize_by(token: token)