app/controllers/subscriptions_controller.rb

    def create
      # Get details from the request parameters
      user_id = AuthToken.find_user_id_by_token(params[:token])
      credits = 0
      purchase_end_time = Date.today + 30.days

      # Create the new subscription
      subscription = Subscription.new(
        user_id: user_id,
        credits: credits,
        view_count: 1,
        purchased_end_time: purchase_end_time
      )

      if subscription.save
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "subscriptions" ("user_id", "credits", "view_count", "purchased_end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 22], ["credits", 0], ["view_count", 1], ["purchased_end_time", "2023-09-04"], ["created_at", "2023-08-05 06:33:52.908436"], ["updated_at", "2023-08-05 06:33:52.908436"]]

    def update_view_count
        # Find all subscriptions
        subscriptions = Subscription.all

        subscriptions.each do |subscription|
          # Check if the subscription has not expired (purchase_end_time is in the future)
          if subscription.purchased_end_time >= Date.today
            # If it's a new day, reset the view_count to 0
            if subscription.updated_at.to_date < Date.today
              subscription.update(view_count: 0)
            end

            # Increment the view_count by 1

            subscription.update(view_count: subscription.credits+1)
---
SELECT "subscriptions".* FROM "subscriptions"
UPDATE "subscriptions" SET "view_count" = ?, "updated_at" = ? WHERE "subscriptions"."id" = ?  [["view_count", 1], ["updated_at", "2023-08-05 06:39:42.169083"], ["id", 1]]

      def increment_views_and_decrease_view_count
        user_id = AuthToken.find_user_id_by_token(params[:token])
        post_id = params[:post_id]

        post = Post.find_by(id: post_id)
        subscription = Subscription.find_by(user_id: user_id)

        if post && subscription
          post.increment!(:number_of_views)
          new_view_count = subscription.view_count - 1
          new_view_count = [new_view_count, 0].max # Ensure it doesn't go below 0

          subscription.update(view_count: new_view_count)
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? LIMIT ?  [["user_id", 22], ["LIMIT", 1]]
UPDATE "subscriptions" SET "credits" = ?, "updated_at" = ? WHERE "subscriptions"."id" = ?  [["credits", 1], ["updated_at", "2023-08-05 06:45:43.223468"], ["id", 1]]

      def set_credits
        user_id = AuthToken.find_user_id_by_token(params[:token])
            subscription = Subscription.find_by(user_id: user_id)
            return render json: { error: "Subscription not found for the user" }, status: :not_found unless subscription

            new_credits = params[:credits].to_i
            subscription.update(credits: new_credits)
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? LIMIT ?  [["user_id", 22], ["LIMIT", 1]]
UPDATE "subscriptions" SET "credits" = ?, "updated_at" = ? WHERE "subscriptions"."id" = ?  [["credits", 1], ["updated_at", "2023-08-05 06:45:43.223468"], ["id", 1]]