app/controllers/upload_posts_controller.rb

INSERT INTO "posts" ("user_id", "post_img", "title", "topic", "post_date", "text", "number_likes", "number_comm", "number_of_views", "total_reading_time", "created_at", "updated_at", "subtitle") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      @post = Post.new(upload_post_params)
      if @post.save