app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def following
      user = User.find(params[:id])