app/controllers/versions_controller.rb

  def show_post_versions

    user_id = AuthToken.find_user_id_by_token(params[:token])


    post = Post.find_by(id: params[:post_id], user_id: user_id)
    if post.nil?
      render json: { error: "Post not found for the specified user" }, status: :not_found
      return
    end

    versions = post.versions.order(created_at: :desc)


    transformed_versions = versions.map do |version|
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? AND "posts"."user_id" = ? LIMIT ?  [["id", 11], ["user_id", 22], ["LIMIT", 1]]
SELECT "versions".* FROM "versions" WHERE "versions"."post_id" = ? ORDER BY "versions"."created_at" DESC  [["post_id", 11]]